TestCases/Archive/BubbleColumnPop/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1812                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Xiang - Need to change mesh to bubbling test 

vertices
(
    (0 0 0)
    (0.29 0 0)
    (0.31 0 0)
    (0.584 0 0)
    (0 0.292 0)
    (0.29 0.292 0)
    (0.31 0.292 0)
    (0.584 0.292 0)
    (0 0.584 0)
    (0.29 0.584 0)
    (0.31 0.584 0)
    (0.584 0.584 0)
    (0 0 0.1)
    (0.29 0 0.1)
    (0.31 0 0.1)
    (0.584 0 0.1)
    (0 0.292 0.1)
    (0.29 0.292 0.1)
    (0.31 0.292 0.1)
    (0.584 0.292 0.1)
    (0 0.584 0.1)
    (0.29 0.584 0.1)
    (0.31 0.584 0.1)
    (0.584 0.584 0.1)
);

blocks
(
    hex (0 1 5 4 12 13 17 16) (20 48 1) simpleGrading (1 1 1) 
    hex (1 2 6 5 13 14 18 17) (4 48 1) simpleGrading (1 1 1)
    hex (2 3 7 6 14 15 19 18) (20 48 1) simpleGrading (1 1 1)
    hex (4 5 9 8 16 17 21 20) (20 48 1) simpleGrading (1 1 1)
    hex (5 6 10 9 17 18 22 21) (4 48 1) simpleGrading (1 1 1)
    hex (6 7 11 10 18 19 23 22) (20 48 1) simpleGrading (1 1 1) 
    
    // hex (0 1 5 4 12 13 17 16) (40 96 1) simpleGrading (1 1 1)
    // hex (1 2 6 5 13 14 18 17) (8 96 1) simpleGrading (1 1 1)
    // hex (2 3 7 6 14 15 19 18) (40 96 1) simpleGrading (1 1 1)
    // hex (4 5 9 8 16 17 21 20) (40 96 1) simpleGrading (1 1 1)
    // hex (5 6 10 9 17 18 22 21) (8 96 1) simpleGrading (1 1 1)
    // hex (6 7 11 10 18 19 23 22) (40 96 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    leftWall
    {
        type wall;
        faces
        (
            (0 12 16 4)
            (4 16 20 8)
        );
    }

    rightWall
    {
        type wall;
        faces
        (
            (7 19 15 3)
            (11 23 19 7)
        );
    }

    lowerOuterWalls
    {
        type wall;
        faces
        (
            (0 1 13 12)
            (2 3 15 14)
        );
    }

    lowerMidWall
    {
        type wall;
        faces
        (
            (1 2 14 13)
        );
    }

    atmosphere
    {
        type patch;
        faces
        (
            (8 20 21 9)
            (9 21 22 10)
            (10 22 23 11)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
